# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

# Challenge 1 - completed
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
"""
# your code here
driver = 'mysql+pymysql'
user = 'ironhacker_read'
password = 'ir0nhack3r'
ip = '35.239.232.23'
database = 'temp_states'

connection_string = f"{driver}://{user}:{password}@{ip}/{database}"
engine = create_engine(connection_string)
"""
#query1 = """ SELECT * FROM temp_states"""

"""
temp = pd.read_sql(query1, engine)
temp.to_csv("./data/temp.csv")
"""

'\ntemp = pd.read_sql(query1, engine)\ntemp.to_csv("./data/temp.csv")\n'

In [16]:
temp = pd.read_csv("./data/temp.csv").reset_index(drop = True)

#### Print `temp`.

In [19]:
# your code here
temp = temp.drop("Unnamed: 0", axis =1)
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
# your code here

In [6]:
#temp.describe()

In [7]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
Unnamed: 0     7 non-null int64
City           7 non-null object
State          7 non-null object
Temperature    7 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 304.0+ bytes

In [8]:
"""
two types of data - object and float 
data type is in concordnce to input
both city and state are strings therefore object in the pd DataFrame, and temp is a number with decimals thereofre  a float

"""

'\ntwo types of data - object and float \ndata type is in concordnce to input\nboth city and state are strings therefore object in the pd DataFrame, and temp is a number with decimals thereofre  a float\n\n'

#### Select the rows where state is New York.

In [24]:
# your code here
temp1 = temp.loc[temp["State"] == "New York"]
temp1

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [30]:
# your code here
# verion 1: temp1.describe() - mean = 10.740741
# version 2:
temp1.mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [32]:
# your code here
temp15 = temp.loc[temp["Temperature"] > 15]
temp15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [36]:
# your code here
cities = list(temp15["City"])
cities

['NYC', 'Hartford', 'Treton', 'Newark']

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [39]:
# your code here
temp15 = temp.loc[temp["Temperature"] > 15].loc[temp["Temperature"] < 20]
temp15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [45]:
# your code here
temp_states = temp.groupby("State").agg(["mean", "std"])
temp_states

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# Challenge 2 -  compelted
- only one challenge was to be completed

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [49]:
"""# your code here
driver = 'mysql+pymysql'
user = 'ironhacker_read'
password = 'ir0nhack3r'
ip = '35.239.232.23'
database = 'employees'

connection_string = f"{driver}://{user}:{password}@{ip}/{database}"
engine = create_engine(connection_string)"""

#query1 = """ SELECT * FROM employees"""

"""employees = pd.read_sql(query1, engine)
employees.to_csv("./data/employees.csv")"""
employees = pd.read_csv("./data/employees.csv")
employees = employees.drop("Unnamed: 0", axis =1)
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [50]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
Name          9 non-null object
Department    9 non-null object
Education     9 non-null object
Gender        9 non-null object
Title         9 non-null object
Years         9 non-null int64
Salary        9 non-null int64
dtypes: int64(2), object(5)
memory usage: 584.0+ bytes

In [ ]:
"""
All types are correctly labeled, strings are labeled as objects, intigers as int.
Looking at the data shows that the column "Years" contains the number of years in the company and not a data, 
and is therefore also labeled correctly. 
No NaN vallues. 
Salary must be either in hourly rate (doubtful) or in thoudands per year (more likely).
"""

#### What's the average salary in this company?

In [52]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [53]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [54]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [58]:
# your code here
employees_min = employees.loc[employees["Salary"] == 30]
employees_min

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [59]:
# your code here
employees.loc[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [64]:
# your code here
david_salary = employees["Salary"].loc[employees["Name"] == "David"].reset_index(drop=True)
print(list(david_salary))

[30]

#### Print all the rows where job title is associate.

In [65]:
# your code here
employees.loc[employees["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [66]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [67]:
# your code here
employees.loc[employees["Title"] == "associate"].loc[employees["Salary"] > 55]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [71]:
# your code here
employees_years = employees.groupby("Years").agg(["mean"])
employees_years

          Salary
            mean
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [80]:
# your code here
employees_title = employees.groupby("Title").agg(["mean"])
employees_title.drop("Years", axis=1)

              Salary
                mean
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [86]:
# your code here
# method 1 = employees.describe() - 25% - 35, 50% - 55, 75% - 60
# method 2:
print(employees["Salary"].quantile(.25))
print(employees["Salary"].quantile(.75))

35.0
60.0

#### Is the mean salary different per gender?

In [91]:
# your code here
employees.groupby("Gender").agg(["mean"]).drop("Years", axis=1)
# there is a slight difference, women, as expected, earn less on average -.-

       Salary
         mean
Gender
F        47.5
M        50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [93]:
# your code here
employees.groupby("Department").agg(["mean", "min", "max"])

               Years         Salary
                mean min max   mean min max
Department
HR          4.666667   2   8  45.00  30  70
IT          4.500000   1   8  48.75  30  70
Sales       2.500000   2   3  55.00  55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [107]:
# your code here
employees_min_max = employees.groupby("Department")
emm = employees_min_max["Salary"].agg(["min", "max"])
emm["salary difference"] = emm[min]-emm[max]
emm

            min  max  salary difference
Department
HR           30   70                 40
IT           30   70                 40
Sales        55   55                  0

# Challenge 3 - not done
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here
driver = 'mysql+pymysql'
user = 'ironhacker_read'
password = 'ir0nhack3r'
ip = '35.239.232.23'
database = 'orders'

connection_string = f"{driver}://{user}:{password}@{ip}/{database}"
engine = create_engine(connection_string)

query1 = """ SELECT * FROM orders
"""

orders = pd.read_sql(query1, engine)
orders.to_csv("./data/orders.csv")

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here
orders.head()

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here